cf/Catalogs/ReportMailings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ReportMailings</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>FTPDirectory</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FTPLogin</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FTPPassiveConnection</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FTPPort</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FTPServer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReplyToAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Archive</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RecipientsEmailAddressKind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ContactInformationKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExecuteOnSchedule</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ArchiveName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseFTPResource</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseFolder</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseNetworkDirectory</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailPicturesInHTMLFormat</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Personal</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Folder</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FilesFolders</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SchedulePeriodicity</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReportMailingSchedulePeriodicities</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Personalized</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLFormatEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsPrepared</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScheduledJob</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NetworkDirectoryLinux</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NetworkDirectoryWindows</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BCCs</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailTextInHTMLFormat</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailSubject</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MailingRecipientType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExtensionObjectIDs</v8:Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NotifyOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TransliterateFileNames</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EmailAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteIncludeDateInFileName</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmailImportance</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShouldInsertReportsIntoEmailBody</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShouldAttachReports</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ShouldSetPasswordsAndEncrypt</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Reports</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Report</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AdditionalReportsAndDataProcessors</v8:Type>
								<v8:Type>cfg:CatalogRef.ReportsOptions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SendIfEmpty</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Settings</Name>
							<Comment>Custom set-up of data components or value Tables</Comment>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DescriptionTemplate</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ReportFormats</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Report</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AdditionalReportsAndDataProcessors</v8:Type>
								<v8:Type>cfg:CatalogRef.ReportsOptions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Format</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ReportSaveFormats</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Recipients</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Recipient</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.BulkEmailRecipient</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Excluded</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/ContactInformationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ContactInformationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Address</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Phone</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Email</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebPage</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Fax</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/ReportMailings/Forms/PasswordDeliveryViaSMS/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	FilterSent = "All";
	MailingRecipientType = Parameters.MailingRecipientType;
	MailingDescription = Parameters.MailingDescription;
	MetadataObjectID = Parameters.MetadataObjectID;
	
	// ACC:1223-off - This is an example of a text message.
	Items.DecorationHint.ToolTip = StringFunctionsClientServer.SubstituteParametersToString(
		NStr("ru = 'Пример SMS: Ваш пароль: ******* для получения рассылки ""%1"".';
			|en = 'A text message example: Your password: ******* to receive the ""%1"" report distribution.';"), MailingDescription);
	// ACC:1223-on
	
	If Not IsTempStorageURL(Parameters.RecipientsAddress) Then
		Return;
	EndIf;
	
	Recipients.Load(GetFromTempStorage(Parameters.RecipientsAddress));

	DeleteFromTempStorage(Parameters.RecipientsAddress); 

	DefineRecipientsPhoneKind();
	PopulatePhoneNumbers();
	
	If Common.IsMobileClient() Then
		CommandBarLocation = FormCommandBarLabelLocation.Top;
		Items.Move(Items.Send, CommandBar); 
		Items.RecipientDescriptionAndPhone.Group = ColumnsGroup.Vertical; 
		Items.Close.Visible = False; 
		Items.Move(Items.Close, CommandBar);
	EndIf;

EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure TypeOfRecipientsPhoneOnChange(Item)
	PopulatePhoneNumbers();
EndProcedure

&AtClient
Procedure FilterSentOnChange(Item)
	SetFiltersInSMSDistributionResult();
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlersRecipients

&AtClient
Procedure RecipientsSelection(Item, RowSelected, Field, StandardProcessing)

	Recipient = Items.Recipients.CurrentData.Recipient;

	If ValueIsFilled(Recipient) Then
		ShowValue( , Recipient);
	EndIf;

EndProcedure

&AtClient
Procedure RecipientsBeforeAddRow(Item, Cancel, Copy, Parent, IsFolder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure RecipientsBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure

#EndRegion

#Region TableItemsEventHandlerOfSMSDistributionResultForm

&AtClient
Procedure SMSDistributionResultSelection(Item, RowSelected, Field, StandardProcessing)
	
	Recipient = Items.SMSDistributionResult.CurrentData.Recipient;

	If ValueIsFilled(Recipient) Then
		ShowValue( , Recipient);
	EndIf;
	
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure Send(Command)
	Items.Send.Visible = False;
	Items.Pages.CurrentPage = Items.PageRuntimeState;
	
	SMSDistributionResult.Clear();
	PreparedSMSMessages = New Array;
	UnsentCount = 0;
	For Each RowRecipients In Recipients Do
		
		If Not ValueIsFilled(RowRecipients.ArchivePassword) Or Not ValueIsFilled(RowRecipients.Phone) Then

			ResultRow = SMSDistributionResult.Add();
			ResultRow.Recipient = RowRecipients.Recipient;
			ResultRow.NotSent = True;

			If Not ValueIsFilled(RowRecipients.ArchivePassword) Then
				ResultRow.Comment = NStr("ru = 'Не установлен пароль.';
													|en = 'A password is not set.';");
			EndIf;

			If Not ValueIsFilled(RowRecipients.Phone) Then
				ResultRow.Comment = ?(ValueIsFilled(ResultRow.Comment),
					ResultRow.Comment + Chars.LF + NStr("ru = 'Не указан номер телефона.';
																	|en = 'A phone number is not specified.';"), 
					NStr("ru = 'Не указан номер телефона.';
						|en = 'A phone number is not specified.';"));
			EndIf;

			StringResultNoFilters = SMSDistributionResultNoFilters.Add();
			FillPropertyValues(StringResultNoFilters, ResultRow);
			UnsentCount = UnsentCount + 1;
			Continue;
		EndIf;
		
		PrepareSMS = New Structure("Recipient, SMSMessageText, PhoneNumbers");
		PrepareSMS.Recipient = RowRecipients.Recipient;
		// ACC:1223-off - This is a text message.
		PrepareSMS.SMSMessageText = StringFunctionsClientServer.SubstituteParametersToString(
		NStr("ru = 'Ваш пароль: %1 для получения рассылки ""%2"".';
			|en = 'Your password: %1 to receive the ""%2"" report distribution.';"), RowRecipients.ArchivePassword,
		MailingDescription);
		// ACC:1223-on
		PrepareSMS.PhoneNumbers = CommonClientServer.ValueInArray(RowRecipients.Phone);
		PreparedSMSMessages.Add(PrepareSMS);
		
	EndDo;
	
	StartupParameters = New Structure("PreparedSMSMessages, UnsentCount, Form");
	StartupParameters.PreparedSMSMessages = PreparedSMSMessages;
	StartupParameters.Form = ThisObject;
	StartupParameters.UnsentCount = UnsentCount;
	
	ReportMailingClient.SendBulkSMSMessages(StartupParameters);
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure SetFiltersInSMSDistributionResult()
	
	TableSMSDistributionResultNoFilters = FormAttributeToValue("SMSDistributionResultNoFilters");

	Builder = New QueryBuilder;
	Builder.DataSource = New DataSourceDescription(TableSMSDistributionResultNoFilters);

	Filter = Builder.Filter;

	Sent = Filter.Add("NotSent");
	Sent.ComparisonType	= ComparisonType.Equal;
	Sent.Value		= ?(FilterSent = "SentMessages", False, True);
	Sent.Use	= ?(FilterSent = "All", False, True);

	Builder.Execute();
	ResultTable1 = 	Builder.Result.Unload();

	ValueToFormAttribute(ResultTable1, "SMSDistributionResult");
	
EndProcedure

&AtServer
Procedure PopulatePhoneNumbers()
	
	RecipientsTable = FormAttributeToValue("Recipients");
	ArrayOfRecipients_ = RecipientsTable.UnloadColumn("Recipient");
	
	RecipientsWithPhoneNumbers = ContactsManager.ObjectsContactInformation(ArrayOfRecipients_,
		Enums.ContactInformationTypes.Phone, TypeOfRecipientsPhone);
	
	If RecipientsWithPhoneNumbers.Count() = 0 Then
		Return;
	EndIf;
	
	For Each BulkEmailRecipient In Recipients Do
		FilterParameters = New Structure("Object", BulkEmailRecipient.Recipient);
		FoundStringsWithPhoneNumbers = RecipientsWithPhoneNumbers.FindRows(FilterParameters);
		If FoundStringsWithPhoneNumbers.Count() > 0 Then
			BulkEmailRecipient.Phone = FoundStringsWithPhoneNumbers[0].Presentation;
		EndIf;
	EndDo;
	
EndProcedure

&AtServer
Procedure DefineRecipientsPhoneKind()
	
	RecipientsMetadata = Common.MetadataObjectByID(MetadataObjectID, False);
	CIGroupName = StrReplace(RecipientsMetadata.FullName(), ".", "");
	CIGroup = ContactsManager.ContactInformationKindByName(CIGroupName);
	
	Query = New Query;
	Query.Text = "SELECT TOP 1 Ref FROM Catalog.ContactInformationKinds WHERE Parent = &Parent AND Type = &Type";
	Query.SetParameter("Parent", CIGroup);
	Query.Parameters.Insert("Type", Enums.ContactInformationTypes.Phone);
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		TypeOfRecipientsPhone = Selection.Ref;
	EndIf;
	
EndProcedure

#EndRegion
